app/controllers/taches_controller.rb

  def create
    @tache = Tache.new(params[:tache])

    respond_to do |format|
      if @tache.save
---
INSERT INTO "taches" ("date_sortie", "statut", "updated_at", "poids", "description", "date_entree", "commentaire", "created_at") VALUES(NULL, NULL, '2009-08-03 14:53:03', NULL, NULL, NULL, NULL, '2009-08-03 14:53:03')

  def destroy
    @tache = Tache.find(params[:id])
    @tache.destroy
---
DELETE FROM "taches" WHERE "id" = 953125641